# Restaurant Recommendation System

## Popularity Based Recommendation

### Importing Libraries

In [2]:
import pandas as pd
import numpy as np

C:\Users\ssc\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\ssc\anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
C:\Users\ssc\anaconda3\lib\site-packages\numpy\.libs\libopenblas64__v0.3.21-gcc_10_3_0.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

### Importing Data

In [3]:
ratings = pd.read_csv('rating_final.csv')
cuisine = pd.read_csv('chefmozcuisine.csv')

In [4]:
ratings

     userID  placeID  rating  food_rating  service_rating
0     U1077   135085       2            2               2
1     U1077   135038       2            2               1
2     U1077   132825       2            2               2
3     U1077   135060       1            2               2
4     U1068   135104       1            1               2
...     ...      ...     ...          ...             ...
1156  U1043   132630       1            1               1
1157  U1011   132715       1            1               0
1158  U1068   132733       1            1               0
1159  U1068   132594       1            1               1
1160  U1068   132660       0            0               0

[1161 rows x 5 columns]

In [5]:
cuisine

     placeID        Rcuisine
0     135110         Spanish
1     135109         Italian
2     135107  Latin_American
3     135106         Mexican
4     135105       Fast_Food
..       ...             ...
911   132005         Seafood
912   132004         Seafood
913   132003   International
914   132002         Seafood
915   132001   Dutch-Belgian

[916 rows x 2 columns]

### Finding Most Rated Restaurants

In [5]:
# group ratings data by unique restaurants and find the count of ratings for each restaurant
rating_count = pd.DataFrame(ratings.groupby('placeID')['rating'].count())

# Sort data to get most rated restaurants on top
rating_count.sort_values('rating', ascending=False, inplace=True)

rating_count.head()

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25

### Matching Cuisines of most rated Restaurants

In [6]:
# Taking top 5 most rated restaurants from rating_count data frame and merging then with cuisine join with 'placeID'
to_recommend = pd.merge(rating_count.iloc[:5], cuisine, on='placeID')

In [7]:
to_recommend.drop('rating',axis=1, inplace=True)

Below is the list of most rated Restaurants and the cuisine they surve

In [10]:
to_recommend

   placeID         Rcuisine
0   135085        Fast_Food
1   132825          Mexican
2   135032        Cafeteria
3   135032     Contemporary
4   135052              Bar
5   135052  Bar_Pub_Brewery
6   132834          Mexican

In [9]:
cuisine['Rcuisine'].describe()

count         916
unique         59
top       Mexican
freq          239
Name: Rcuisine, dtype: object

Here in the description of cuisines of Restaurants we see that Mexican is the most appearing Cuisine

### Making Recommendation

As we have a list of most rated restaurants and we know mexican is the most frequent cuisine. We can recommend it

In [12]:
to_recommend.query("Rcuisine == 'Mexican'")

   placeID Rcuisine
1   132825  Mexican
6   132834  Mexican

We can recommend these two Restaurants!!!!